app/controllers/reviews_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 208 LIMIT 1
---
  def new
    # レビュー投稿画面へ
    @product = Product.find(params[:product_id])

INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('dice', 10, 'さすがしんちゃん！最高！', 208, '2019-04-19 04:19:33', '2019-04-19 04:19:33')
---
  def create
    # 投稿されたレビューをDBへ保存
    Review.create(create_params)